ext_alsav/DataProcessors/ЗагрузкаСвойствХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаСвойствХарактеристик</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_alsav/Catalogs/НаборыДополнительныхРеквизитовИСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>НаборыДополнительныхРеквизитовИСведений</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav/DataProcessors/ЗагрузкаСвойствХарактеристик/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ЭтаФорма.ДанныеДляЗагрузки.Область(1,1).Текст = ?(ЭтаФорма.ПоискПоАртикулу,"Артикул","Номенклатура");
	ЭтаФорма.ДанныеДляЗагрузки.Область(1,2).Текст = "Характеристика";
	//ЭтаФорма.ДанныеДляЗагрузки.Область(1,3).Текст = "Путь";
	//ЭтаФорма.ДанныеДляЗагрузки.Область(1,4).Текст = "Файл сметы";
	//ЭтаФорма.ДанныеДляЗагрузки.Область(1,5).Текст = "Файл модели";
	
	
	Для Каждого выборкаСвойств из Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ХарактеристикиНоменклатуры_Общие.ДополнительныеРеквизиты Цикл
		нСтр = ЭтаФорма.ДопРеквизиты.Добавить();
		нСтр.Выбрать = ложь;
		нСтр.Свойство = Строка(выборкаСвойств.Свойство.Заголовок);	
	Конеццикла;
	ЭтаФорма.ДопРеквизиты.Сортировать("Свойство");
	
	
	//выборкаСвойств = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Выбрать();	
	//
	//Пока выборкаСвойств.Следующий() Цикл
	//	Если выборкаСвойств.ЭтоГруппа Тогда     НаборыДополнительныхРеквизитовИСведений
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если выборкаСвойств.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ХарактеристикиНоменклатуры_Общие
	//		ИЛИ выборкаСвойств.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ХарактеристикиНоменклатуры
	//		ИЛИ(
	//			НЕ ЗначениеЗаполнено(выборкаСвойств.НаборСвойств)
	//			И  выборкаСвойств.ДополнительныеЗначенияИспользуются
	//			И  НЕ выборкаСвойств.ЭтоДополнительноеСведение
	//		)
	//		Тогда
	//		
	//		нСтр = ЭтаФорма.ДопРеквизиты.Добавить();
	//		нСтр.Выбрать = ложь;
	//		нСтр.Свойство = Строка(выборкаСвойств.Заголовок);
	//	КонецЕсли;
	//КонецЦикла;
	
	ЭтаФорма.Элементы.ГруппаНастройкаСвойств.Видимость = Истина;
	ЭтаФорма.Элементы.ГруппаПродолжить.Видимость = НЕ ЭтаФорма.Элементы.ГруппаНастройкаСвойств.Видимость;	
	
КонецПроцедуры

&НаКлиенте
Процедура Сопоставить(Команда)
	
	цветУспеха = Новый Цвет(0, 255, 127);
	инд = 1;
	Пока инд < 62999 Цикл
		инд = инд + 1;
		
		наименованиеНоменклатуры = СокрЛП(ЭтаФорма.ДанныеДляЗагрузки.Область(инд,1).Текст);
		Если НЕ ЗначениеЗаполнено(наименованиеНоменклатуры) Тогда
			Прервать;
		КонецЕсли;
		
		наименованиеХарактеристики = ЭтаФорма.ДанныеДляЗагрузки.Область(инд,2).Текст;
		
		номен = НайтиНоменклатуру(наименованиеНоменклатуры, ЭтаФорма.ПоискПоАртикулу);
		
		Если НЕ ЗначениеЗаполнено(номен) Тогда
			продолжить;
		КонецЕсли;
		ЭтаФорма.ДанныеДляЗагрузки.Область(инд,1).ЦветФона = цветУспеха;
		
		хар = НайтХарактеристику(номен,наименованиеХарактеристики);		
		
		Если НЕ ЗначениеЗаполнено(хар) Тогда
			продолжить;
		КонецЕсли;
		ЭтаФорма.ДанныеДляЗагрузки.Область(инд,2).ЦветФона = цветУспеха;
		
		//Сообщить(Номен);
		//Сообщить(Хар);
		
		
		кол = 3;
		Пока кол <=30 Цикл
			свойство = ЭтаФорма.ДанныеДляЗагрузки.Область(1,кол).Текст;
			значениеТекст = ЭтаФорма.ДанныеДляЗагрузки.Область(инд,кол).Текст;
			значение = ОпределитьЗначениеСвойства(Свойство,значениеТекст);
			
			Если ЗначениеЗаполнено(свойство) Тогда 
				Если ЗначениеЗаполнено(значение) ИЛИ НЕ ЗначениеЗаполнено(значениеТекст) Тогда
					УстановитьЗначениеДопРеквизита(хар,Свойство,Значение);				
					ЭтаФорма.ДанныеДляЗагрузки.Область(инд,кол).ЦветФона = цветУспеха;
				КонецЕсли;
			Иначе
				Прервать;
			КонецЕсли;
			кол = кол + 1;
		КонецЦикла;		
		
		//ЭтаФорма.ДанныеДляЗагрузки.Область(инд,1).Значение = номен;
		//ЭтаФорма.ДанныеДляЗагрузки.Область(инд,2).Значение = хар;
		
		//Сообщить(номен);
		//Сообщить(хар); 		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьЗначениеСвойства(Свойство,Значение)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		возврат неопределено;
	КонецЕсли;
	
	результ = Значение;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |ГДЕ
	               |	ЗначенияСвойствОбъектов.Владелец.Заголовок = &Заголовок
	               |	И ЗначенияСвойствОбъектов.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Заголовок",Свойство);
	Запрос.УстановитьПараметр("Наименование",Значение);
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		результ = рез.Ссылка;
	Иначе
		допРеквизит = алсав_ДопРеквизиты.НайтиДопРеквизит(Свойство);
		Если ЗначениеЗаполнено(допРеквизит) Тогда
			Если(допРеквизит.ДополнительныеЗначенияИспользуются) Тогда
				результ = неопределено;
			КонецЕсли;
		Иначе
			результ = неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат результ;
КонецФункции

&НаСервереБезКонтекста
Функция УстановитьЗначениеДопРеквизита(ссылка,Свойство,Значение)
	
	об = ссылка.ПолучитьОбъект();
	алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(об,Свойство,Значение);
	
	об.Записать();
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиНоменклатуру(наименованиеНоменклатуры, поискПоАртикулу)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Наименование = &наименованиеНоменклатуры";
	
	Запрос.УстановитьПараметр("наименованиеНоменклатуры", наименованиеНоменклатуры);
	
	Если поискПоАртикулу Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Наименование", ".Артикул");
	конецЕсли;
	
	рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат рез.Ссылка;
	КонецЕсли;
КонецФУнкции


&НаСервереБезКонтекста
Функция НайтХарактеристику(НоменклатураВладелец, наименованиеХарактеристики)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Наименование ПОДОБНО &наименованиеХарактеристики
	               |	И ХарактеристикиНоменклатуры.Владелец = &НоменклатураВладелец";
	
	Запрос.УстановитьПараметр("НоменклатураВладелец", НоменклатураВладелец);
	Запрос.УстановитьПараметр("наименованиеХарактеристики", наименованиеХарактеристики);
	
	рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат рез.Ссылка;
	КонецЕсли;
КонецФУнкции

&НаКлиенте
Процедура ПоискПоАртикулуПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЭтаФорма.ДанныеДляЗагрузки.Область(1,1).Текст = ?(ЭтаФорма.ПоискПоАртикулу,"Артикул","Номенклатура")
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСвойств(Команда)
	ЭтаФорма.Элементы.ГруппаНастройкаСвойств.Видимость = Истина;
	ЭтаФорма.Элементы.ГруппаПродолжить.Видимость = НЕ ЭтаФорма.Элементы.ГруппаНастройкаСвойств.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКЗакгрузке(Команда)
	ПерейтиКЗакгрузкеСервер();
КонецПроцедуры

&НаСервере
Процедура ПерейтиКЗакгрузкеСервер()
	ЭтаФорма.Элементы.ГруппаНастройкаСвойств.Видимость = Ложь;
	ЭтаФорма.Элементы.ГруппаПродолжить.Видимость = НЕ ЭтаФорма.Элементы.ГруппаНастройкаСвойств.Видимость;
	
	ОбластьУдаления = ЭтаФорма.ДанныеДляЗагрузки.Область(, 3, , 50);
	Смещать = ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	ЭтаФорма.ДанныеДляЗагрузки.УдалитьОбласть(ОбластьУдаления, Смещать);
	
	столбецСвойств = 3;
	Для Каждого стр из Этаформа.ДопРеквизиты Цикл
		
		Если стр.Выбрать Тогда		
			ЭтаФорма.ДанныеДляЗагрузки.Область(1,столбецСвойств).Текст = стр.Свойство;
			столбецСвойств = столбецСвойств + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
